
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
 <head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
  <title>[1/6] x86: drop unneded members of struct cpuinfo_x86 - Patchwork</title>
  <link rel="stylesheet" type="text/css" href="/static/css/style.css"/>
  <script type="text/javascript" src="/static/js/common.js"></script>
  <script type="text/javascript" src="/static/js/jquery-1.10.1.min.js"></script>

 </head>
 <body>
  <div id="title">
  <h1 style="float: left;">
     <a
      href="/">Patchwork</a>
    [1/6] x86: drop unneded members of struct cpuinfo_x86</h1>
  <div id="auth">

     <a href="/user/login/">login</a>
     <br/>
     <a href="/register/">register</a>
     <br/>
     <a href="/mail/">mail settings</a>

   </div>
   <div style="clear: both;"></div>
  </div>
  <div id="nav">
   <div id="navleft">
   
    <strong>Project</strong>: LKML
     :
     <a href="/project/LKML/list/"
      >patches</a>
     :
     <a href="/project/LKML/"
      >project info</a>
    
     :
     <a href="/"
     >other projects</a>
     
    
   </div>
   <div id="navright">
    <a href="/help/about/">about</a>
   </div>
   <div style="clear: both"></div>
  </div>

  <div id="content">

<script language="JavaScript" type="text/javascript">
function toggle_headers(link_id, headers_id)
{
    var link = document.getElementById(link_id)
    var headers = document.getElementById(headers_id)

    var hidden = headers.style['display'] == 'none';

    if (hidden) {
        link.innerHTML = 'hide';
        headers.style['display'] = 'block';
    } else {
        link.innerHTML = 'show';
        headers.style['display'] = 'none';
    }

}
</script>

<table class="patchmeta">
 <tr>
  <th>Submitter</th>
  <td><a href="/project/LKML/list/?submitter=16732">Mathias Krause</a></td>
 </tr>
 <tr>
  <th>Date</th>
  <td>Feb. 12, 2017, 9:12 p.m.</td>
 </tr>
 <tr>
  <th>Message ID</th>
  <td>&lt;1486933932-585-2-git-send-email-minipli@googlemail.com&gt;</td>
 </tr>
 <tr>
  <th>Download</th>
  <td>
   <a href="/patch/9568527/mbox/"
   >mbox</a>
|
   <a href="/patch/9568527/raw/"
   >patch</a>

   </td>
 </tr>
 <tr>
  <th>Permalink</th>
  <td><a href="/patch/9568527/">/patch/9568527/</a>
 </tr>
  <tr>
   <th>State</th>
   <td>New</td>
  </tr>


 <tr>
  <th>Headers</th>
  <td><a id="togglepatchheaders"
   href="javascript:toggle_headers('togglepatchheaders', 'patchheaders')"
   >show</a>
   <div id="patchheaders" class="patchheaders" style="display:none;">
    <pre>Return-Path: &lt;linux-kernel-owner@kernel.org&gt;
Received: from mail.wl.linuxfoundation.org (pdx-wl-mail.web.codeaurora.org
	[172.30.200.125])
	by pdx-korg-patchwork.web.codeaurora.org (Postfix) with ESMTP id
	15B7160572 for &lt;patchwork-LKML@patchwork.kernel.org&gt;;
	Sun, 12 Feb 2017 21:12:31 +0000 (UTC)
Received: from mail.wl.linuxfoundation.org (localhost [127.0.0.1])
	by mail.wl.linuxfoundation.org (Postfix) with ESMTP id 07C9A27F60
	for &lt;patchwork-LKML@patchwork.kernel.org&gt;;
	Sun, 12 Feb 2017 21:12:31 +0000 (UTC)
Received: by mail.wl.linuxfoundation.org (Postfix, from userid 486)
	id F09D927FC0; Sun, 12 Feb 2017 21:12:30 +0000 (UTC)
X-Spam-Checker-Version: SpamAssassin 3.3.1 (2010-03-16) on
	pdx-wl-mail.web.codeaurora.org
X-Spam-Level: 
X-Spam-Status: No, score=-7.0 required=2.0 tests=BAYES_00,DKIM_SIGNED,
	DKIM_VALID, DKIM_VALID_AU, FREEMAIL_FROM,
	RCVD_IN_DNSWL_HI autolearn=ham version=3.3.1
Received: from vger.kernel.org (vger.kernel.org [209.132.180.67])
	by mail.wl.linuxfoundation.org (Postfix) with ESMTP id 5CE9927F60
	for &lt;patchwork-LKML@patchwork.kernel.org&gt;;
	Sun, 12 Feb 2017 21:12:30 +0000 (UTC)
Received: (majordomo@vger.kernel.org) by vger.kernel.org via listexpand
	id S1751417AbdBLVM2 (ORCPT
	&lt;rfc822;patchwork-LKML@patchwork.kernel.org&gt;);
	Sun, 12 Feb 2017 16:12:28 -0500
Received: from mail-wm0-f65.google.com ([74.125.82.65]:34256 &quot;EHLO
	mail-wm0-f65.google.com&quot; rhost-flags-OK-OK-OK-OK) by vger.kernel.org
	with ESMTP id S1751275AbdBLVMY (ORCPT
	&lt;rfc822;linux-kernel@vger.kernel.org&gt;);
	Sun, 12 Feb 2017 16:12:24 -0500
Received: by mail-wm0-f65.google.com with SMTP id c85so16037372wmi.1
	for &lt;linux-kernel@vger.kernel.org&gt;;
	Sun, 12 Feb 2017 13:12:23 -0800 (PST)
DKIM-Signature: v=1; a=rsa-sha256; c=relaxed/relaxed;
	d=googlemail.com; s=20161025;
	h=from:to:cc:subject:date:message-id:in-reply-to:references;
	bh=0ZIX2TTOQyC+jXXO9TW3ENjkO8+c7/MQMH5reXSEkGQ=;
	b=D+/iqVBydRPvCVVyMNzjnjyAx3yJQb4Ogqt6QsQm2+DJsvKDvqBQcEkgruYFma6IyA
	WNZLT5Fj+vNHOR6L1wjKGX9n46wmaD0vgCpjc90E804j9tDBV6DXze0TVcq88KrX6Se4
	IMNe+qJDs4wpvlDvAt/jnV9SRsB4qjznwdHZeivaG8upFgZ2XwG6+hMN4bUfIV3XX+L5
	5xalLW7tDb9/+r6YFoJOsmtTsmBM7ttYKTn1UCM4GT6/bjiLfTISd8+ITK+SOkHCYZ27
	hBk176PgmH54rfzbgMFOXfHGtUMfUyC7sGLVJg2PWcKvy0drm0Mu2qza71WN/b6Syq0g
	CqGA==
X-Google-DKIM-Signature: v=1; a=rsa-sha256; c=relaxed/relaxed;
	d=1e100.net; s=20161025;
	h=x-gm-message-state:from:to:cc:subject:date:message-id:in-reply-to
	:references;
	bh=0ZIX2TTOQyC+jXXO9TW3ENjkO8+c7/MQMH5reXSEkGQ=;
	b=J4uH4fcDQnH2L7Z2fdf+cLemRyMGj2fPNnd5fDA/G9QhNwEKMaogYk7g0LgJd2/U5f
	g4eZLWpDSh97EcXU0QJg1jayMUtdQWEoWUsRT+IipSD7xL56H0RvG3fQgg7RrmqbGnlG
	iq1qi7v3BDR9vQz/KH8L6A4jrTsWfwlJJ0t52cpFvles1aGRzRyetW/X+gtDVESD59E3
	pZwDifwnRTSwT+NF/OT+yKrkf42ncaXbpvbvJE5he9iHJIQLFkTp3bXrnywK6M5BWgol
	xAJFKxTgR+yigdAdagbiWvyCkoukbq7V9SWdaRyZ+k9cZNM/a4Z0lz5OWJGkKUS6qU0j
	OFWg==
X-Gm-Message-State: AMke39m1/JyovvcM378b1FLBA1abU3vVb1GqOQbTxYkLF4SbtiJP2tUtw+5gbFJ23mPhDg==
X-Received: by 10.28.57.131 with SMTP id g125mr15508755wma.33.1486933942599; 
	Sun, 12 Feb 2017 13:12:22 -0800 (PST)
Received: from jig.jsk-medianet.de ([84.19.217.240])
	by smtp.gmail.com with ESMTPSA id
	u198sm2707703wmf.9.2017.02.12.13.12.19
	(version=TLS1_2 cipher=ECDHE-RSA-AES128-GCM-SHA256 bits=128/128);
	Sun, 12 Feb 2017 13:12:22 -0800 (PST)
From: Mathias Krause &lt;minipli@googlemail.com&gt;
To: Thomas Gleixner &lt;tglx@linutronix.de&gt;, Ingo Molnar &lt;mingo@redhat.com&gt;,
	&quot;H. Peter Anvin&quot; &lt;hpa@zytor.com&gt;
Cc: Andrew Morton &lt;akpm@linux-foundation.org&gt;,
	Borislav Petkov &lt;bp@alien8.de&gt;, &quot;David S. Miller&quot; &lt;davem@davemloft.net&gt;,
	Jesper Nilsson &lt;jesper.nilsson@axis.com&gt;,
	Mikael Starvik &lt;starvik@axis.com&gt;,
	Geert Uytterhoeven &lt;geert@linux-m68k.org&gt;, x86@kernel.org,
	linux-kernel@vger.kernel.org, Mathias Krause &lt;minipli@googlemail.com&gt;,
	&quot;H. Peter Anvin&quot; &lt;hpa@linux.intel.com&gt;
Subject: [PATCH 1/6] x86: drop unneded members of struct cpuinfo_x86
Date: Sun, 12 Feb 2017 22:12:07 +0100
Message-Id: &lt;1486933932-585-2-git-send-email-minipli@googlemail.com&gt;
X-Mailer: git-send-email 1.7.10.4
In-Reply-To: &lt;1486933932-585-1-git-send-email-minipli@googlemail.com&gt;
References: &lt;1486933932-585-1-git-send-email-minipli@googlemail.com&gt;
Sender: linux-kernel-owner@vger.kernel.org
Precedence: bulk
List-ID: &lt;linux-kernel.vger.kernel.org&gt;
X-Mailing-List: linux-kernel@vger.kernel.org
X-Virus-Scanned: ClamAV using ClamSMTP
</pre>
   </div>
  </td>
 </tr>
</table>

<div class="patchforms">





 <div style="clear: both;">
 </div>
</div>



<h2>Comments</h2>

<div class="comment">
<div class="meta"><a href="/project/LKML/list/?submitter=16732">Mathias Krause</a> - Feb. 12, 2017, 9:12 p.m.</div>
<pre class="content">
Those member serve no purpose -- not even fill padding for alignment or
such. So just get rid of them.

Cc: Borislav Petkov &lt;bp@alien8.de&gt;
Cc: H. Peter Anvin &lt;hpa@linux.intel.com&gt;
<span class="signed-off-by">Signed-off-by: Mathias Krause &lt;minipli@googlemail.com&gt;</span>
---
 arch/x86/include/asm/processor.h |    7 +------
 1 file changed, 1 insertion(+), 6 deletions(-)
</pre>
</div>

<div class="comment">
<div class="meta"><a href="/project/LKML/list/?submitter=7500">Borislav Petkov</a> - Feb. 14, 2017, 4:17 p.m.</div>
<pre class="content">
On Sun, Feb 12, 2017 at 10:12:07PM +0100, Mathias Krause wrote:
<span class="quote">&gt; Those member serve no purpose -- not even fill padding for alignment or</span>
<span class="quote">&gt; such. So just get rid of them.</span>

Well, almost. You need the wp_works_ok removal patch too, otherwise you
have the 3 bytes hole below.

But the wp_works_ok goes away too so I guess that&#39;s fine.

$ pahole -C cpuinfo_x86 vmlinux
struct cpuinfo_x86 {
        __u8                       x86;                  /*     0     1 */
        __u8                       x86_vendor;           /*     1     1 */
        __u8                       x86_model;            /*     2     1 */
        __u8                       x86_mask;             /*     3     1 */
        char                       wp_works_ok;          /*     4     1 */
        __u8                       x86_virt_bits;        /*     5     1 */
        __u8                       x86_phys_bits;        /*     6     1 */
        __u8                       x86_coreid_bits;      /*     7     1 */
        __u8                       cu_id;                /*     8     1 */

        /* XXX 3 bytes hole, try to pack */

        __u32                      extended_cpuid_level; /*    12     4 */
        int                        cpuid_level;          /*    16     4 */
        __u32                      x86_capability[19];   /*    20    76 */
        /* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
        char                       x86_vendor_id[16];    /*    96    16 */
        char                       x86_model_id[64];     /*   112    64 */
        /* --- cacheline 2 boundary (128 bytes) was 48 bytes ago --- */
        int                        x86_cache_size;       /*   176     4 */
        int                        x86_cache_alignment;  /*   180     4 */
        int                        x86_cache_max_rmid;   /*   184     4 */
        int                        x86_cache_occ_scale;  /*   188     4 */
        /* --- cacheline 3 boundary (192 bytes) --- */
        int                        x86_power;            /*   192     4 */
        long unsigned int          loops_per_jiffy;      /*   196     4 */
        u16                        x86_max_cores;        /*   200     2 */
        u16                        apicid;               /*   202     2 */
        u16                        initial_apicid;       /*   204     2 */
        u16                        x86_clflush_size;     /*   206     2 */
        u16                        booted_cores;         /*   208     2 */
        u16                        phys_proc_id;         /*   210     2 */
        u16                        logical_proc_id;      /*   212     2 */
        u16                        cpu_core_id;          /*   214     2 */
        u16                        cpu_index;            /*   216     2 */

        /* XXX 2 bytes hole, try to pack */

        u32                        microcode;            /*   220     4 */

        /* size: 224, cachelines: 4, members: 30 */
        /* sum members: 219, holes: 2, sum holes: 5 */
        /* last cacheline: 32 bytes */
};
</pre>
</div>

<div class="comment">
<div class="meta"><a href="/project/LKML/list/?submitter=16732">Mathias Krause</a> - Feb. 14, 2017, 4:40 p.m.</div>
<pre class="content">
On 14 February 2017 at 17:17, Borislav Petkov &lt;bp@alien8.de&gt; wrote:
<span class="quote">&gt; On Sun, Feb 12, 2017 at 10:12:07PM +0100, Mathias Krause wrote:</span>
<span class="quote">&gt;&gt; Those member serve no purpose -- not even fill padding for alignment or</span>
<span class="quote">&gt;&gt; such. So just get rid of them.</span>
<span class="quote">&gt;</span>
<span class="quote">&gt; Well, almost. You need the wp_works_ok removal patch too, otherwise you</span>
<span class="quote">&gt; have the 3 bytes hole below.</span>

Heh, indeed! But only since commit 79a8b9aa388b (&quot;x86/CPU/AMD: Bring
back Compute Unit ID&quot;) ;)
<span class="quote">
&gt; But the wp_works_ok goes away too so I guess that&#39;s fine.</span>
<span class="quote">&gt;</span>
<span class="quote">&gt; $ pahole -C cpuinfo_x86 vmlinux</span>
<span class="quote">&gt; struct cpuinfo_x86 {</span>
<span class="quote">&gt;         __u8                       x86;                  /*     0     1 */</span>
<span class="quote">&gt;         __u8                       x86_vendor;           /*     1     1 */</span>
<span class="quote">&gt;         __u8                       x86_model;            /*     2     1 */</span>
<span class="quote">&gt;         __u8                       x86_mask;             /*     3     1 */</span>
<span class="quote">&gt;         char                       wp_works_ok;          /*     4     1 */</span>
<span class="quote">&gt;         __u8                       x86_virt_bits;        /*     5     1 */</span>
<span class="quote">&gt;         __u8                       x86_phys_bits;        /*     6     1 */</span>
<span class="quote">&gt;         __u8                       x86_coreid_bits;      /*     7     1 */</span>
<span class="quote">&gt;         __u8                       cu_id;                /*     8     1 */</span>
<span class="quote">&gt;</span>
<span class="quote">&gt;         /* XXX 3 bytes hole, try to pack */</span>

The cu_id member is &quot;new&quot;. Without it there would be no hole. But,
yeah, without wp_works_ok everything&#39;s fine again.

Cheers,
Mathias
</pre>
</div>

<div class="comment">
<div class="meta"><a href="/project/LKML/list/?submitter=70">Geert Uytterhoeven</a> - Feb. 14, 2017, 5:56 p.m.</div>
<pre class="content">
Hi Boris,

On Tue, Feb 14, 2017 at 5:17 PM, Borislav Petkov &lt;bp@alien8.de&gt; wrote:
<span class="quote">&gt; On Sun, Feb 12, 2017 at 10:12:07PM +0100, Mathias Krause wrote:</span>
<span class="quote">&gt;&gt; Those member serve no purpose -- not even fill padding for alignment or</span>
<span class="quote">&gt;&gt; such. So just get rid of them.</span>
<span class="quote">&gt;</span>
<span class="quote">&gt; Well, almost. You need the wp_works_ok removal patch too, otherwise you</span>
<span class="quote">&gt; have the 3 bytes hole below.</span>

That&#39;s because you removed a char in commit 93a829e8e2c292f1
(&quot;x86, cpu: Convert FDIV bug detection), without compensating with padding ;-)

Gr{oetje,eeting}s,

                        Geert

--
Geert Uytterhoeven -- There&#39;s lots of Linux beyond ia32 -- geert@linux-m68k.org

In personal conversations with technical people, I call myself a hacker. But
when I&#39;m talking to journalists I just say &quot;programmer&quot; or something like that.
                                -- Linus Torvalds
</pre>
</div>

<div class="comment">
<div class="meta"><a href="/project/LKML/list/?submitter=7500">Borislav Petkov</a> - Feb. 14, 2017, 6:21 p.m.</div>
<pre class="content">
On Tue, Feb 14, 2017 at 06:56:22PM +0100, Geert Uytterhoeven wrote:
<span class="quote">&gt; That&#39;s because</span>

No, what Mathias said.
</pre>
</div>

<div class="comment">
<div class="meta"><a href="/project/LKML/list/?submitter=42">H. Peter Anvin</a> - Feb. 14, 2017, 6:46 p.m.</div>
<pre class="content">
On 02/14/17 09:56, Geert Uytterhoeven wrote:
<span class="quote">&gt;&gt;</span>
<span class="quote">&gt;&gt; Well, almost. You need the wp_works_ok removal patch too, otherwise you</span>
<span class="quote">&gt;&gt; have the 3 bytes hole below.</span>
<span class="quote">&gt; </span>
<span class="quote">&gt; That&#39;s because you removed a char in commit 93a829e8e2c292f1</span>
<span class="quote">&gt; (&quot;x86, cpu: Convert FDIV bug detection), without compensating with padding ;-)</span>
<span class="quote">&gt; </span>

Padding isn&#39;t a problem (other than efficiency) for a structure which is
strictly internal to the kernel as opposed to an ABI structure.

	-hpa
</pre>
</div>



<h2>Patch</h2>
<div class="patch">
<pre class="content">
<span class="p_header">diff --git a/arch/x86/include/asm/processor.h b/arch/x86/include/asm/processor.h</span>
<span class="p_header">index e6cfe7ba2d65..bf7cb1e00ce7 100644</span>
<span class="p_header">--- a/arch/x86/include/asm/processor.h</span>
<span class="p_header">+++ b/arch/x86/include/asm/processor.h</span>
<span class="p_chunk">@@ -80,7 +80,7 @@</span> <span class="p_context"> enum tlb_infos {</span>
 
 /*
  *  CPU type and hardware bug flags. Kept separately for each CPU.
<span class="p_del">- *  Members of this structure are referenced in head.S, so think twice</span>
<span class="p_add">+ *  Members of this structure are referenced in head_32.S, so think twice</span>
  *  before touching them. [mj]
  */
 
<span class="p_chunk">@@ -91,11 +91,6 @@</span> <span class="p_context"> struct cpuinfo_x86 {</span>
 	__u8			x86_mask;
 #ifdef CONFIG_X86_32
 	char			wp_works_ok;	/* It doesn&#39;t on 386&#39;s */
<span class="p_del">-</span>
<span class="p_del">-	/* Problems on some 486Dx4&#39;s and old 386&#39;s: */</span>
<span class="p_del">-	char			rfu;</span>
<span class="p_del">-	char			pad0;</span>
<span class="p_del">-	char			pad1;</span>
 #else
 	/* Number of 4K pages in DTLB/ITLB combined(in pages): */
 	int			x86_tlbsize;

</pre>
</div>




  </div>
  <div id="footer">
   <a href="http://jk.ozlabs.org/projects/patchwork/">patchwork</a>
   patch tracking system
  </div>
 </body>
</html>



